package eu.kanade.tachiyomi.extension.ja.ichicomi

import eu.kanade.tachiyomi.multisrc.gigaviewer.GigaViewer
import keiyoushi.annotation.Source

@Source
abstract class Ichicomi : GigaViewer() {
    override val seriesListIds = listOf("2550912965889047616")

    override fun getFilterOptions() = listOf(
        "すべて" to seriesListIds,
        "echo" to listOf("2550912965796689066", "2550912965796689067", "2550912965796689072"),
        "gateau" to listOf("2550912965796689074", "2550912965796689075", "2550912965796689080"),
        "カラフルハピネス" to listOf("2550912965796689089", "2550912965796689092", "2550912965796689093"),
        "REX" to listOf("2550912965796689101", "2550912965796689105", "2550912965796689108"),
        "HOWL" to listOf("2550912965796689112", "2550912965796689114", "2550912965796689120"),
        "POOL" to listOf("2550912965796689123", "2550912965796689131", "2550912965796689144"),
        "百合姫" to listOf("2550912965796689168", "2550912965796689175", "2550912965796689183"),
        "LAKE" to listOf("2550912965796689148", "2550912965796689158", "2550912965796689163"),
        "ZERO-SUM" to listOf("2550912965796689187", "2550912965796689195", "2550912965796689196"),
        "ぱれっと" to listOf("2550912965796689199", "2550912965796689206", "2550912965796689212"),
        "ベビードール" to listOf("2550912965796689213", "2550912965796689214", "2550912965796689218"),
        "一迅プラス" to listOf("2550912965796689248", "2550912965796689255", "2550912965796689266"),
        "恋愛" to listOf("Genre:2550912965827315660"),
        "ラブコメ" to listOf("Genre:2550912965827315672"),
        "コメディ・ギャグ" to listOf("Genre:2550912965827315678"),
        "ホラー" to listOf("Genre:2550912965827315681"),
        "サスペンス" to listOf("Genre:2550912965827315687"),
        "アクション・バトル" to listOf("Genre:2550912965827315689"),
        "歴史・時代" to listOf("Genre:2550912965827315693"),
        "日常" to listOf("Genre:2550912965827315695"),
        "ヒューマンドラマ" to listOf("Genre:2550912965827315700"),
        "異世界・転生" to listOf("Genre:2550912965827315707"),
        "ファンタジー" to listOf("Genre:2550912965827315710"),
        "百合" to listOf("Genre:2550912965827315711"),
        "BL" to listOf("Genre:2550912965827315722"),
        "TL" to listOf("Genre:2550912965827315725"),
        "学園・青春" to listOf("Genre:2550912965827315726"),
        "お仕事" to listOf("Genre:2550912965827315727"),
        "メディア化" to listOf("Genre:2550912965827315728"),
        "新人・読切" to listOf("Genre:2550912965827315729"),
        "完結" to listOf("Genre:2550912965827315734"),
        "オリジナル" to listOf("Genre:2550912965827315743"),
    )
}
