package eu.kanade.tachiyomi.extension.uk.dgmanga

import eu.kanade.tachiyomi.source.model.Filter

abstract class SelectFilter(
    name: String,
    private val options: List<Pair<String, String>>,
    defaultValue: String? = null,
) : Filter.Select<String>(
    name = name,
    values = options.map { it.first }.toTypedArray(),
    state = options.indexOfFirst { it.second == defaultValue }.takeIf { it >= 0 } ?: 0,
) {
    val selected get() = options[state].second.takeUnless { it.isBlank() }
}

internal class OrderBy :
    SelectFilter(
        "Сортувати за",
        listOf(
            "Популярністю" to "popular",
            "Оновленням" to "updated",
            "Алфавітом" to "alphabetical",
            "Рейтингом" to "rating",
        ),
        "rating",
    )
internal class StatusFilter :
    SelectFilter(
        "Статус тайтлу",
        listOf(
            "Будь-який статус" to "",
            "Видається" to "Видається",
            "Завершено" to "Завершено",
            "Анонс" to "Анонс",
            "Призупинено" to "Призупинено",
        ),
    )
internal class TranslationStatusFilter :
    SelectFilter(
        "Статус перекладу",
        listOf(
            "Будь-який статус" to "",
            "Перекладається" to "Перекладається",
            "Завершено" to "Завершено",
            "Покинуто" to "Покинуто",
        ),
    )
internal class LicensedFilter :
    SelectFilter(
        "Ліцензія",
        listOf(
            "Всі" to "",
            "Тільки ліцензовані" to "true",
            "Без ліцензії" to "false",
        ),
    )
internal class TypeFilter :
    SelectFilter(
        "Тип",
        listOf(
            "Всі" to "",
            "Манґа" to "manga",
            "Манхва" to "manhwa",
            "Маньхва" to "manhua",
            "Вестерн" to "western",
            "Мальопис" to "Мальописи",
        ),
    )

internal class MultiValueOption(name: String, val value: String) : Filter.CheckBox(name)

internal abstract class MultiValueFilter(
    name: String,
    values: List<Pair<String, String>>,
) : Filter.Group<MultiValueOption>(
    name = name,
    state = values.map { MultiValueOption(it.first, it.second) },
) {
    val selectedValues: List<String> get() = state.filter { it.state }.map { it.value }
    val active get() = state.filter { it.state }.map { it.value }.takeUnless { it.isEmpty() }
}
internal class GenresFilter : MultiValueFilter("Жанри", values) {
    companion object {
        val values = listOf(
            "Антиутопія" to "Антиутопія",
            "Антологія" to "Антологія",
            "Апокаліпсис" to "Апокаліпсис",
            "Бойовик" to "Бойовик",
            "Бойові мистецтва" to "Бойові мистецтва",
            "Виживання" to "Виживання",
            "Гарем" to "Гарем",
            "Дарк романтика" to "Дарк романтика",
            "Детектив" to "Детектив",
            "Джьосей" to "Джьосей",
            "Для дітей" to "Для дітей",
            "Доджінші" to "Доджінші",
            "Драма" to "Драма",
            "Еротика" to "Еротика",
            "Еччі" to "Еччі",
            "Жахи" to "Жахи",
            "Жорстокість" to "Жорстокість",
            "Зворотній гарем" to "Зворотній гарем",
            "Зміна статі" to "Зміна статі",
            "Ігри" to "Ігри",
            "Ісекай" to "Ісекай",
            "Історичний сеттинг" to "Історичний сеттинг",
            "Іяшікей" to "Іяшікей",
            "Йонкома" to "Йонкома",
            "Кодомомуке" to "Кодомомуке",
            "Комедія" to "Комедія",
            "Космос" to "Космос",
            "Махо-шьоджьо" to "Махо-шьоджьо",
            "Махо-шьонен" to "Махо-шьонен",
            "Меха" to "Меха",
            "Містика" to "Містика",
            "Надприродне" to "Надприродне",
            "Наукова фантастика" to "Наукова фантастика",
            "Омегаверс" to "Омегаверс",
            "Пародія" to "Пародія",
            "Повсякденність" to "Повсякденність",
            "Постапокаліптика" to "Постапокаліптика",
            "Пригоди" to "Пригоди",
            "Психологія" to "Психологія",
            "Романтика" to "Романтика",
            "Сейнен" to "Сейнен",
            "Сентай" to "Сентай",
            "Сентай" to "Сентай",
            "Трагедія" to "Трагедія",
            "Трилер" to "Трилер",
            "Університет" to "Університет",
            "Утопія" to "Утопія",
            "Фантастика" to "Фантастика",
            "Фентезі" to "Фентезі",
            "Філософія" to "Філософія",
            "Школа" to "Школа",
            "Шьоджьо" to "Шьоджьо",
            "Шьоджьо-ай" to "Шьоджьо-ай",
            "Шьонен" to "Шьонен",
            "Шьонен-ай" to "Шьонен-ай",
            "Юрі" to "Юрі",
            "Яой" to "Яой",
        )
    }
}
internal class TagsFilter :
    MultiValueFilter(
        "Теги",
        listOf(
            "Адаптація" to "Адаптація",
            "Академія" to "Академія",
            "Ангст" to "Ангст",
            "Аристократія" to "Аристократія",
            "Артефакти" to "Артефакти",
            "Бара" to "Бара",
            "БДСМ" to "БДСМ",
            "Божевілля" to "Божевілля",
            "Бої" to "Бої",
            "Бої на мечах" to "Бої на мечах",
            "Вампіри" to "Вампіри",
            "Відео-ігри" to "Відео-ігри",
            "Війна" to "Війна",
            "Віртуальна реальність" to "Віртуальна реальність",
            "Втрата пам'яті" to "Втрата пам'яті",
            "Вуличні бої" to "Вуличні бої",
            "Габаритний актив" to "Габаритний актив",
            "Габаритний пасив" to "Габаритний пасив",
            "ГГ жінка" to "ГГ жінка",
            "ГГ чоловік" to "ГГ чоловік",
            "Гендерна інтрига" to "Гендерна інтрига",
            "Ґідверс" to "Ґідверс",
            "Гільдії" to "Гільдії",
            "Ґяру" to "Ґяру",
            "Демони" to "Демони",
            "Діти" to "Діти",
            "Дорослі стосунки" to "Дорослі стосунки",
            "Дружба" to "Дружба",
            "Друзі дитинства" to "Друзі дитинства",
            "Епізод життя" to "Епізод життя",
            "Еспери" to "Еспери",
            "Звірі" to "Звірі",
            "Звіролюди" to "Звіролюди",
            "Злочини" to "Злочини",
            "Знущання" to "Знущання",
            "Зомбі" to "Зомбі",
            "Зрада" to "Зрада",
            "Кінки" to "Кінки",
            "Кохання" to "Кохання",
            "Культивація" to "Культивація",
            "Куховарення" to "Куховарення",
            "Лиходії" to "Лиходії",
            "Любовний квадрат" to "Любовний квадрат",
            "Любовний трикутник" to "Любовний трикутник",
            "Магія" to "Магія",
            "Медицина" to "Медицина",
            "Мистецтво" to "Мистецтво",
            "Міфічні істоти" to "Міфічні істоти",
            "Молодший актив" to "Молодший актив",
            "Молодший пасив" to "Молодший пасив",
            "Музика" to "Музика",
            "Насилля" to "Насилля",
            "Непорозуміння" to "Непорозуміння",
            "Нерозділене кохання" to "Нерозділене кохання",
            "Нінджя" to "Нінджя",
            "Обмін тілами" to "Обмін тілами",
            "Одержимість" to "Одержимість",
            "Офісні працівники" to "Офісні працівники",
            "Парапсихологія" to "Парапсихологія",
            "Перше кохання" to "Перше кохання",
            "Підземелля" to "Підземелля",
            "Підняття вежею" to "Підняття вежею",
            "Політика" to "Політика",
            "Поліція" to "Поліція",
            "Прибульці" to "Прибульці",
            "Привиди" to "Привиди",
            "Провідники" to "Провідники",
            "Регресія" to "Регресія",
            "Реінкарнація" to "Реінкарнація",
            "Ретро" to "Ретро",
            "Різниця у віці" to "Різниця у віці",
            "Саб-дом" to "Саб-дом",
            "Садизм-мазохізм" to "Садизм-мазохізм",
            "Самураї" to "Самураї",
            "Система" to "Система",
            "Старший актив" to "Старший актив",
            "Старший пасив" to "Старший пасив",
            "Стрибок у часі" to "Стрибок у часі",
            "Суперсили" to "Суперсили",
            "Сучасність" to "Сучасність",
            "Тентаклі" to "Тентаклі",
            "Трансгендери" to "Трансгендери",
            "Фетишизм" to "Фетишизм",
            "Цундере" to "Цундере",
            "Чарівники" to "Чарівники",
            "Чудовиська" to "Чудовиська",
            "Шоубіз" to "Шоубіз",
            "Якудзи" to "Якудзи",
            "Янголи" to "Янголи",
            "Яндере" to "Яндере",
        ),
    )
